Repository: juniorlemos/Inventario-Escolar-Pro
Catalog: src/Shared/InventarioEscolar.Exceptions/ResourceMessagesException.*.resx
Languages: pt_br

# MAXIMUM_DESCRIPTION_NUMBER
source: Invalid description. The description can have a maximum of 200 characters.
pt_br: Descrição invalida. A descrição pode ter no máximo 200 caracteres.

# INVALID_NUMBER_NAME
source: Invalid name. The name must be between 3 and 100 characters.
pt_br: Nome inválido. O nome deve conter entre 3 e 100 caracteres.

# NAME_EMPTY
source: The name cannot be empty.
pt_br: O nome não pode estar vazio.

source: Unknown error.
pt_br: Erro desconhecido.

# ASSET_CODE_MUST_BE_POSITIVE
source: Error, the asset code must be a positive number.
pt_br: Erro, o código patrimonial deve ser um número positivo.

# NEGATIVE_NUMBER
source: The field value must be a positive number ve number
pt_br: O valor do campo deve ser um número positivo

# CONSERVATION_STATE_NOT_SUPPORTED;
source: The conservation status of the asset is not recognized
pt_br: O estado de conservação do ativo não é reconhecido

# MAXIMUM_SERIE_NUMBER
source: Invalid serie number. The serie number can have a maximum of 30 characters.
pt_br: Numero de serie invalido .O numero de serie pode ter no máximo 30 caracteres.

# INVALID_CATEGORY
source: The category is mandatory and must be valid.
pt_br: A categoria é obrigatória e deve ser válida.

# INVALID_ROOM_LOCALIZATION
source: The location room must be valid.
pt_br: A sala de localização deve ser válida.

source: Asset not found
pt_br: Patrimônio não encontrado

source: Patrimony code already exists
pt_br: O código de patrimônio já existe

source: Room location name already exists
pt_br: Já existe uma localização de sala com este nome.

# ROOMLOCATION_NAME_TOOSHORT
source: The room location name must be at least 2 characters long.
pt_br: O nome da sala deve ter pelo menos 2 caracteres.

# ROOMLOCATION_NAME_TOOLONG
source: The room location name must not exceed 100 characters.
pt_br: O nome da sala não deve exceder 100 caracteres.

# ROOMLOCATION_DESCRIPTION_TOOLONG
source: The room location description must not exceed 200 characters.
pt_br: A descricão da sala não deve exceder 100 caracteres.

# ROOMLOCATION_BUILDING_TOOLONG
source: The room location building must not exceed 50 characters.
pt_br: O nome do edifício de localização da sala não deve exceder 50 caracteres.

source: School name already exists
pt_br: Já existe uma escola com este nome.

# SCHOOL_NAME_TOOLONG
source: The school name must not exceed 100 characters.
pt_br: O nome da escola deve exceder 100 caracteres.

# SCHOOL_NAME_TOOSHORT
source: The school name must be at least 2 characters long.
pt_br: O nome da escola deve ter pelo menos 2 caracteres.

# SCHOOL_INEP_TOOLONG
source: The school INEP must not exceed 20 characters.
pt_br: O INEP da escola deve exceder 20 caracteres.

# SCHOOL_ADDRESS_TOOLONG
source: The school address must not exceed 100 characters.
pt_br: O Endereço da escola deve exceder 100 caracteres.

# SCHOOL_CITY_TOOLONG
source: The school city must not exceed 30 characters.
pt_br: O nome da cidade da escola deve exceder 30 caracteres.

source: School INEP already exists
pt_br: Já existe uma escola com este INEP.

source: School address already exists
pt_br: Já existe uma escola com este endereço.

# CATEGORY_NAME_TOOLONG
source: The category name must not exceed 100 characters.
pt_br: O nome da category deve exceder 100 caracteres.

# CATEGORY_NAME_TOOSHORT
source: The category name must be at least 2 characters long.
pt_br: O nome da categoria deve ter pelo menos 2 caracteres.

# CATEGORY_DESCRIPTION_TOOLONG
source: The category description must not exceed 200 characters.
pt_br: A descricão da categoria não deve exceder 100 caracteres.

source: Category name already exists
pt_br: Já existe uma categoria com este nome.

source: School not found
pt_br: Escola não encontrada

source: Room location not found.
pt_br: Sala não encontrada

source: Category not found
pt_br: Categoria não encontrada

source: School id invalid
pt_br: O id da escola está inválido

source: Room location id invalid
pt_br: O id da sala está inválido

source: Category id invalid
pt_br: O id da categoria está inválido

source: Asset id invalid
pt_br: O id do patrimônio está inválido

# ASSETMOVEMENT_ASSET_ID_INVALID
source: Asset ID must be greater than 0.
pt_br: O ID do ativo deve ser maior que 0.

# ASSETMOVEMENT_FROM_ROOM_ID_INVALID
source: From Room ID must be greater than 0.
pt_br: O ID da sala de origem deve ser maior que 0.

# ASSETMOVEMENT_TO_ROOM_ID_INVALID
source: To Room ID must be greater than 0.
pt_br: O ID da sala de destino deve ser maior que 0.

# ASSETMOVEMENT_MOVED_AT_INVALID
source: Moved At date cannot be in the future.
pt_br: A data da movimentação não pode estar no futuro.

# ASSETMOVEMENT_RESPONSIBLE_NAME_TOO_LONG
source: Asset movement responsible name cannot exceed 100 characters.
pt_br: O nome do responsável pela movimentação do patrimonio não pode exceder 100 caracteres.

source: Asset movement not found.
pt_br: Movimentação de patrimônio não encontrado.

# ROOMLOCATION_NOT_FOUND_ORIGIN
source: Room location origin not found.
pt_br: Sala de origem não encontrada

# ROOMLOCATION_NOT_FOUND_DESTINATION
source: Room location destination not found.
pt_br: Sala de destino não encontrada

source: Asset movement same room.
pt_br: Movimentação de patrimono na mesma sala.

# ASSETMOVEMENT_CANCELREASON_TOO_LONG
source: Asset movement cancel reason cannot exceed 200 characters.
pt_br: O motivo do cancelamento da movimentação do patrimônio não pode exceder 200 caracteres.

# ROOMLOCATION_HAS_ASSETS
source: Cannot delete room location because it still has assets assigned.
pt_br: Não é possível excluir a sala porque ela ainda possui ativos vinculados.

# CATEGORY_HAS_ASSETS
source: Cannot delete category because it still has assets assigned.
pt_br: Não é possível excluir a categoria porque ela ainda possui ativos vinculados.

# SCHOOL_HAS_DEPENDENCIES
source: Cannot delete the school because it still has associated rooms, assets, or categories.
pt_br: Não é possível excluir a escola porque ela ainda possui salas, ativos ou categorias vinculadas.
